# パラメータ設定用プログラム

import numpy as np
# =========================================================
# 視覚刺激パラメータ定義
# =========================================================
elemSize = 0.1                                                                                                 # ドットサイズ [deg]
dotsDensity = 15                                                                                                # ドット密度[%]
surrPatch_range = 11                                                                                            # 無相関パッチの描画範囲 [deg]
Disk_radius = 3                                                                                                 # 相関ありパッチの半径 [deg]

disparity_arr = [-0.5, -0.2, -0.1,  -0.05, -0.03, 0, 0.03, 0.05, 0.1, 0.2, 0.5]                                                         # 刺激の視差リスト
# disparity_arr = [-0.5, 0.5]                                                         # 刺激の視差リスト

# =========================================================
# 呈示パラメータ定義
# =========================================================
fixation_start = 0.5                                                                                            # 固視点呈示開始時刻
fixation_end = 1.5                                                                                              # 固視点呈示終了時刻

stim_start = fixation_end                                                                                       # 刺激呈示開始時刻
present_time = 5.4                                                                                             # 刺激呈示時間
stim_end = stim_start + present_time                                                                            # 刺激呈示終了時刻

resp_start = stim_end+0.3                                                                                       # 応答開始時間

# =========================================================
# 実験パラメータ定義
# =========================================================
N_repeat = 20
stimOder = 'random'
